Revit 2024 API
IFCExportOptions.Assign Method
 Assigns the values of the IFCExportOptions to this options object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void Assign(
	IFCExportOptions sourceOptions
)
Visual Basic
Public Sub Assign ( _
	sourceOptions As IFCExportOptions _
)
Visual C++
public:
void Assign(
	IFCExportOptions^ sourceOptions
)
Parameters
sourceOptions
Type: Autodesk.Revit.DB.IFCExportOptions
 The source IFCExportOptions.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
IFCExportOptions Class
Autodesk.Revit.DB Namespace